[
    {
        "speaker": "woman_mature / Professional counselor",
        "speaking": "我们先从一个问题开始：当你看见她反复在关系中靠近又撤退，你第一反应是什么？很多人会说——她是不是有问题？但在这里，我想邀请你换一个视角：不是“她病了”，而是“她有理由”。这种长期的不安感、关系里的摇摆，其实是在告诉我们，她一直在努力活下去。",
        "actions": "calm; sits slightly forward, hands open, eye contact gentle",
        "visual": "Modern era, early evening in autumn, light rain outside. A softly lit counseling studio with warm wooden floors, floor-to-ceiling windows, city lights blurred by rain, a small plant on a low table.",
        "voiceover": "我好像也总是这样，一边渴望亲近，一边又想逃走。你这么一说，我突然好奇：我是在害怕什么？"
    },
    {
        "speaker": "woman_mature / Professional counselor",
        "speaking": "如果我们再走近一点看，她的心理特征其实很清晰：缺乏安全感、自我价值低落、需要通过关系确认“我是谁”。这不是性格缺陷，而是依恋受挫后的自然反应。她学会了一个残酷的公式：靠近可能会受伤，但孤独同样会痛。",
        "actions": "sad; slight pause, slow nod, voice softens",
        "visual": "Late 1990s, winter night, dimly lit apartment interior. Old furniture, flickering fluorescent light, thin curtains moving with cold air, a sense of quiet isolation.",
        "voiceover": "这句话太戳我了……我一直以为是我太敏感，原来是我在两种痛苦之间反复选择。"
    },
    {
        "speaker": "woman_mature / Professional counselor",
        "speaking": "很多人会问：那这一切从哪里开始的？往往是在童年。缺乏保护、价值被忽略，甚至在暴力与短暂的安抚之间来回切换。于是她发展出撤离、防御、隐身这些“生存策略”。它们曾经救过她，但在成年后，却悄悄变成重复的关系模式。",
        "actions": "fearful; brows knit briefly, then relaxes, hands clasped",
        "visual": "Early 2000s, summer afternoon with harsh sunlight. A narrow residential alley, peeling walls, a small child’s shadow on concrete, distant sounds of arguing from an unseen room.",
        "voiceover": "我突然意识到，我现在的冷处理，其实是小时候学会的。那时候，不被看见反而更安全。"
    },
    {
        "speaker": "woman_mature / Professional counselor",
        "speaking": "这里有一个容易被忽略的转折点：当你意识到这些模式是“求生”而不是“作死”，羞耻感会慢慢松动。惊讶的是，很多看似破坏关系的行为，其实是在保护那个曾经无助的自己。",
        "actions": "surprised; slight smile of realization, shoulders ease",
        "visual": "Present day, early morning in spring, clear sky after rain. A quiet café with sunlight pouring through windows, reflections on wooden tables, a sense of fresh start.",
        "voiceover": "原来我不是在搞砸关系，我是在自保。这个念头让我有点想哭，也有点轻松。"
    },
    {
        "speaker": "woman_mature / Professional counselor",
        "speaking": "所以，疗愈从哪里开始？不是立刻改变自己，而是建立一点点安全感：给情绪命名，找回自我价值的来源，把“依靠”慢慢从他人身上收回到自己身上。我也想问你：你身上有哪些“撤退信号”？你穿过怎样的盔甲？当有人真正听见你时，你是否也更容易开始听见自己？",
        "actions": "calm; warm smile, open palms, steady breathing",
        "visual": "Contemporary era, golden hour at sunset, early summer. A riverside park with trees swaying lightly, people walking slowly, warm light reflecting on water, atmosphere of quiet hope.",
        "voiceover": "我想试着先听见自己，也许从承认“我已经很努力了”开始。你说的这些，让我第一次觉得，改变是可能的。"
    }
]
