[
    {
        "speaker": "woman_mature / Professional counselor",
        "speaking": "在开始之前，我想先问你一个问题：如果一个人从小就知道，家不是休息的地方，而是需要随时撤离的战场，她会把“安全”放在生命的什么位置？今天的故事，从这样一个孩子开始。",
        "actions": "calm; the counselor sits upright on a chair, voice gentle, hands resting loosely on her knees, making steady eye contact with the audience",
        "visual": "Contemporary era, late autumn evening, cloudy weather. A quiet counseling office with warm lighting, wooden furniture, a soft rug on the floor. Outside the window, fallen leaves line a narrow city street."
    },
    {
        "speaker": "woman_mature / Professional counselor",
        "speaking": "她学会了很多生存技巧：提前听懂声音、默默退场、把自己缩到最不显眼的位置。这些策略在童年救过她，可你有没有想过——当一个孩子必须靠“消失”来活下去，长大后，她还能自然地被看见吗？",
        "actions": "sad; the counselor slightly tilts her head, pauses briefly, fingers gently interlaced as if holding a fragile thought",
        "visual": "Late 1990s, winter night, cold and dry. An old residential building with dim corridor lights. Inside, narrow hallways and closed doors; outside, a single streetlamp casts long shadows on the snow-dusted ground."
    },
    {
        "speaker": "woman_mature / Professional counselor",
        "speaking": "成年后的她，一次次走进关系，又一次次离开。表面看是感情反复，深处却像在不断确认同一个问题：这一次，我会被留下吗？而当靠近真的发生，她却又本能地后退。你是否也在某些关系里，体验过这种拉扯？",
        "actions": "fearful; the counselor raises one hand slightly, then lets it fall back, mirroring approach and withdrawal",
        "visual": "Modern era, early spring dusk, light drizzle. A small urban apartment balcony overlooking a busy intersection. Car headlights blur into reflections on wet asphalt below."
    },
    {
        "speaker": "woman_mature / Professional counselor",
        "speaking": "在咨询室里，她问的不是‘我怎么会这样’，而是‘我是不是没有价值’。这不是软弱，而是一种深层的羞耻在说话。如果一个人从未被真正保护过，她又如何相信，自己值得被温柔对待？",
        "actions": "calm; the counselor leans forward slightly, voice lower and steadier, conveying containment and respect",
        "visual": "Contemporary era, rainy afternoon. The counseling room feels enclosed and safe; a tissue box and two armchairs face each other. Rain taps softly against the window glass."
    },
    {
        "speaker": "woman_mature / Professional counselor",
        "speaking": "但这个故事，也不只是关于创伤。她一次次走进咨询室，本身就是一种答案。也许真正值得我们一起看的，是这些问题：你在什么时候选择了撤退？你曾穿过怎样的“盔甲”？而当有人真正听见你时，会不会有什么开始慢慢改变？接下来，让我们一起走进她的故事，也走进这些问题背后的可能性。",
        "actions": "calm; the counselor offers a small, reassuring nod, hands open, posture relaxed but grounded",
        "visual": "Contemporary era, early morning after rain, clear sky. Soft sunlight fills the counseling room. A cup of warm tea on a small wooden table releases gentle steam; outside, the city begins a new day."
    }
]
